

"Checking" = "檢查中...";

"No updates found" = "恭喜！您當前的版本已經是最新";

"Update checking error" = "檢查出錯，請稍後重試。";

"Feedback" = "用戶反饋";

"Check for update" = "檢查新版本";

"Version" = "版本";

"New Version Found" = "發現新版本: ";

"Skip" = "跳過";

"Ignore" = "忽略";

"Update now" = "立即更新";

"About" = "關于";

"Return" = "返回";

"Current Location" = "當前位置";

"Target Location" = "穿越位置";

"Exploring On..." = "您正在穿越中...";

"Exploring Off..." = "已退出穿越...";

"Longitude" = "經度";

"Latitude" = "緯度";

"You must choose a location before traveling" = "請選擇穿越位置(長按地圖)";

"Notice" = "提示";

"Ok" = "好";

"Done" = "完成";

"Location service unvailable, check your settings please." = "無法定位。請去\"設置\"中爲\"GPS穿越器\"開啓定位服務";

"Positioning..." = "定位中...";

"Location service unvailable, traveling fails" = "當前位置無法確定，啓動穿越失敗";

"Favorites" = "收藏";

"No favorites yet" = "暫無收藏地址";

"No geo info yet" = "暫無地址描述信息";

"You can collect locations not more than %d" = "收藏失敗。您最多收藏%d個地址";

"Record is in favorites already" = "不能重複收藏";

"Favorites" = "收藏";
"The Hot" = "熱門";
"POIs" = "穿越點";
"Setting" = "設置";
"User Feedback" = "用戶反饋";
"User Instructions" = "使用說明";
"My Points" = "我的能量點";
"Acuire Points" = "增加補給";
"Points" = "能量點";
"Points Instruction" = "請注意查看每個任務的具體流程並嚴格遵守(如試用分鍾)，避免完成任務後無法檢測到新增的能量點";
"I know" = "知道了";

"This travel needs %d points, please acuire more points" = "穿越到此地需要消耗%d個能量點，請進行補給。";
"Points low, please acquire more" = "你的能量過低，請進行補給";

"This travel consumes %d points" = "-%d";
"Acquire now" = "立即補給";
"Later" = "不了";
"meter(s)" = "m";
"km(s)" = "km";
"Unknown" = "未知";
"Location info loading..." = "地理信息獲取中...";
